In [48]:
import pandas as pd
import numpy as np

In [49]:
%pwd

'C:\\Users\\tmznq\\workspace\\ml_scratch\\seoul_coding_academy\\study'

In [50]:
!dir # !: 윈도우 명령입력. 즉, 명령프롬프트(cmd)랑 같은 상태임. 근데 왜 폴더 이동 안되냐... ㅠ ㅠ

지정된 경로를 찾을 수 없습니다.

In [51]:
# error : Install xlrd >= 1.0.0 for Excel support 이거 깔으랍니다.
# !pip install xlrd

In [52]:
path = 'C:/Users/tmznq/workspace/ml_scratch/seoul_coding_academy/강의자료/excel_exam.xlsx'
data = pd.read_excel(path)
data.head()

   id  class  math  english  science
0   1      1    50       98       50
1   2      1    60       97       60
2   3      1    45       86       78
3   4      1    30       98       58
4   5      2    25       80       65

#### 문제 정의
- 반별 과목별 평균을 구하고, 반별 평균보다 높은 학생 id를 출력하라.

In [53]:
# class와 id에 따른 pivoting
df = data.pivot_table(index=['class', 'id'])
df.head()

          english  math  science
class id
1     1        98    50       50
      2        97    60       60
      3        86    45       78
      4        98    30       58
2     5        80    25       65

In [54]:
# 학생의 과목별 평균 구하기.
df2 = np.mean(df, axis = 0)
df2

english    84.90
math       57.45
science    59.45
dtype: float64

In [55]:
# 반 별 grouping
df2 = df.groupby(level = 0, group_keys=False) # group_keys....?
df2

In [56]:
for i in df2:
    print(i)

(1,           english  math  science
class id
1     1        98    50       50
      2        97    60       60
      3        86    45       78
      4        98    30       58)
(2,           english  math  science
class id
2     5        80    25       65
      6        89    50       98
      7        90    80       45
      8        78    90       25)
(3,           english  math  science
class id
3     9        98    20       15
      10       98    50       45
      11       65    65       65
      12       85    45       32)
(4,           english  math  science
class id
4     13       98    46       65
      14       87    48       12
      15       56    75       78
      16       98    58       65)
(5,           english  math  science
class id
5     17       68    65       98
      18       78    80       90
      19       68    89       87
      20       83    78       58)

In [102]:
# 4반만 뽑아보자...?
for cls, group in df2:
    if i==3:
        break
    i=+1
print(cls, group)

5           english  math  science
class id
5     17       68    65       98
      18       78    80       90
      19       68    89       87
      20       83    78       58

In [104]:
df2.rank()[:4]

          english  math  science
class id
1     1       3.5   3.0      1.0
      2       2.0   4.0      3.0
      3       1.0   2.0      4.0
      4       3.5   1.0      2.0

In [105]:
df2.mean()[:4]

       english   math  science
class
1        94.75  46.25    61.50
2        84.25  61.25    58.25
3        86.50  45.00    39.25
4        84.75  56.75    55.00

In [79]:
result = pd.DataFrame(df2.apply(lambda x: x[x > x.mean()].rank(method = 'first', ascending = False))) # x[x > x.mean()] : fancy indexing
result

          english  math  science
class id
1     1       1.0   2.0      NaN
      2       3.0   1.0      NaN
      3       NaN   NaN      1.0
      4       2.0   NaN      NaN
2     5       NaN   NaN      2.0
      6       2.0   NaN      1.0
      7       1.0   2.0      NaN
      8       NaN   1.0      NaN
3     9       1.0   NaN      NaN
      10      2.0   2.0      2.0
      11      NaN   1.0      1.0
      12      NaN   NaN      NaN
4     13      1.0   NaN      2.0
      14      3.0   NaN      NaN
      15      NaN   1.0      1.0
      16      2.0   2.0      3.0
5     17      NaN   NaN      1.0
      18      2.0   2.0      2.0
      19      NaN   1.0      3.0
      20      1.0   NaN      NaN

In [39]:
result[['english']].dropna()

         english
class id
1     1       98
      2       97
      3       미달
      4       98
2     5       미달
      6       89
      7       90
      8       미달
3     9       98
      10      98
      11      미달
      12      미달
4     13      98
      14      87
      15      미달
      16      98
5     17      미달
      18      78
      19      미달
      20      83

In [40]:
# solution
path = 'C:/Users/tmznq/workspace/ml_scratch/seoul_coding_academy/강의자료/excel_exam.xlsx'

def id(path, subject = ''):
    data = pd.read_excel(path) # excel 불러오기
    df = data.pivot_table(index=['class', 'id']) # data pivot
    df2 = df.groupby(level = 0, group_keys=False) # groupby
    result = pd.DataFrame(df2.apply(lambda x: x[x > x.mean()])) # apply에 함수 적용
    
    return result[['{}'.format(subject)]].dropna()

In [82]:
path = 'C:/Users/tmznq/workspace/ml_scratch/seoul_coding_academy/강의자료/excel_exam.xlsx'

def all(path):
    data = pd.read_excel(path) # excel 불러오기
    df = data.pivot_table(index=['class', 'id']) # data pivot
    df2 = df.groupby(level = 0, group_keys=False) # groupby
    result = pd.DataFrame(df2.apply(lambda x: x[x > x.mean()]).fillna(value = '평균미달'))
    return result

In [87]:
path = 'C:/Users/tmznq/workspace/ml_scratch/seoul_coding_academy/강의자료/excel_exam.xlsx'

def _rank(path):
    data = pd.read_excel(path) # excel 불러오기
    df = data.pivot_table(index=['class', 'id']) # data pivot
    df2 = df.groupby(level = 0, group_keys=False) # groupby
    result = pd.DataFrame(df2.apply(lambda x: x[x > x.mean()].rank(method = 'first', ascending = False)).fillna(value = '평균미달'))
    return result

In [108]:
id(path, subject = 'english')[:4]

          english
class id
1     1      98.0
      2      97.0
      4      98.0
2     6      89.0

In [107]:
all(path)[:4]

         english  math science
class id
1     1       98    50    평균미달
      2       97    60    평균미달
      3     평균미달  평균미달      78
      4       98  평균미달    평균미달

In [106]:
_rank(path)[:4]

         english  math science
class id
1     1        1     2    평균미달
      2        3     1    평균미달
      3     평균미달  평균미달       1
      4        2  평균미달    평균미달

___

In [200]:
# cf) class별 평균으로 정렬해보기.
result2 = pd.DataFrame(df2.apply(lambda x: x.sort_values(ascending=False)))
result2.head()

               mean
class id
1     2   72.333333
      3   69.666667
      1   66.000000
      4   62.000000
2     6   79.000000